tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

brew "coreutils" # 基本的なコマンドが入っている。 cf. https://hiroyukim.hatenablog.jp/entry/2015/03/22/000551
brew "cask"
brew "curl"
brew "grep"
brew "git"
brew "peco" # cf. https://qiita.com/xtetsuji/items/05f6f4c1b17854cdd75b
brew "fasd" # cf. https://wonderwall.hatenablog.com/entry/2016/06/26/143224
brew "ghq"
brew "gh"
brew "asdf" # ruby や Node などのバージョン管理ツール
brew "jq"
brew "imagemagick"
# 以下は Rails 周りの何かっぽい。消して問題なさそうであれば消す
# brew "glib" # クロスプラットフォームユーティリティライブラリ
# brew "guile" # Scheme 言語のインタプリタ。どこかから参照されている。
# brew "gnutls" # SSL/TLS 実装の1つ。 guile から参照されている。
# brew "gnupg" # ファイルや通信を暗号化するために使われる暗号化ソフト
# brew "shared-mime-info" # glib から参照されている。
# brew "libheif" # shared-mime-info から参照されている
# brew "emacs" # gnutls から参照されている。

# バージョン指定外してよければ外す
# brew "postgresql@14"

# 問題なさそうであれば消す
# brew "msgpack" # cf. https://msgpack.org/ja.html
# brew "nmap" # ポートスキャンツール
# brew "python@3.9", link: false

cask "iterm2"
cask "visual-studio-code"

cask "google-chrome"
cask "microsoft-edge"

cask "alfred"
